homebrew-packages.org
#+TITLE:     ITL/Homebrew でインストールするパッケージ
#+AUTHOR:    Takeshi Nagae
#+EMAIL:     nagae@m.tohoku.ac.jp
#+LANGUAGE:  ja
#+OPTIONS:   H:3 num:3 toc:2 \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t author:t creator:t
#+OPTIONS:   TeX:t LaTeX:dvipng skip:nil d:nil todo:nil pri:nil tags:not-in-toc timestamp:t
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport

#+OPTIONS: toc:1 num:3

#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto html-preamble:t
#+OPTIONS: html-scripts:t html-style:t html5-fancy:nil tex:imagemagick
#+CREATOR: <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)
#+HTML_CONTAINER: div
#+HTML_DOCTYPE: xhtml-strict
#+HTML_HEAD:<link rel=stylesheet href="style.css" type="text/css">
#+HTML_LINK_UP: https://nagae.github.io/itl
#+HTML_LINK_HOME: https://nagae.github.io
#+INFOJS_OPT: view:showall toc:t sdepth:2 ltoc:1 mouse:nil buttons:nil
#+LATEX_HEADER:\usepackage{amsmath,rmss_math,rmss_color}

* Homebrew でインストールしておくべき UNIX ツール
** 以下を実行する
#+BEGIN_SRC screen
  # 以下のパッケージは独立してインストールできる(他のパッケージに依存しない)
  brew install git                # 分散リポジトリバージョン管理システム．
  brew install nkf                # ファイルの文字コードを一括で変換できる
  brew install ispell             # スペルチェッカー
  brew install lha                # .lhaや.lzh 形式を展開するのに必要
  # 以下のパッケージは他のパッケージに依存する
  brew install rsync              # フォルダのバックアップや同期を取る．
  brew install ghostscript        # Postscript インタプリタ．Emacs上でPDFや画像ファイルを表示させる docview に必須．
  brew install wget               # ウェブサーバーからコンテンツをダウンロード．curl より高機能
  brew install imagemagick --with-tex # 画像操作・表示用ソフトウェア
  brew install xpdf                   # PDF用ユーティリティ
#+END_SRC
** xpdf に日本語サポートパッケージを追加する
*** 日本語サポートパッケージの追加
- 参考URL:
  - http://ototorosama.hatenablog.com/entry/2013/02/14/055355
  - http://d.hatena.ne.jp/rougeref/20070313
- ターミナルで下記を入力[1]：
#+BEGIN_SRC sh
  pushd ~/Downloads
  curl -O http://ftp.jaist.ac.jp/pub/CTAN/support/xpdf/xpdf-japanese.tar.gz # ftp.jaist.ac.jp の代わりに ftp.rikengo.jp, ftp.u-aizu.ac.jp, ftp.kd­di­l­abs.jp のどれかを使ってもよい
  tar -xzvf xpdf-japanese.tar.gz
  cd xpdf-japanese
  ln -s /usr/local/opt/xpdf/share/ /usr/local/share/xpdf # xpdf/share へのシンボリックリンクを作成
  mkdir /usr/local/share/xpdf/japanese                   # japanese ディレクトリを作成
  cp -r * /usr/local/share/xpdf/japanese                 # xpdf-japanese の中身をコピー
  cat /usr/local/share/xpdf/japanese/add-to-xpdfrc >> /usr/local/etc/xpdfrc # xpdfrc に追記
  popd
#+END_SRC
- =/usr/local/etc/xpdfrc= を編集する:

  Emacs や テキストエディットなどで =/usr/local/etc/xpdfrc= を開き, 
  =textEncoding= の行を探してコメントアウトを解除(行頭の =#= を削除)する.

  修正前:
  #+BEGIN_SRC text
  # textEncoding		UTF-8
  #+END_SRC
  修正後:
  #+BEGIN_SRC text
  textEncoding		UTF-8
  #+END_SRC

[1] この方法だと =brew uninstall xpdf= とした時に =/usr/local/share/xpdf= が残ってしまうので， =brew prune= が必要．

*** 使い方
例えば， =sample.pdf= に対して, ターミナルから以下のような処理が行なえる:
#+BEGIN_SRC sh
  pdfinfo sample.pdf              # PDFの文書情報を標示
  pdftops sample.pdf              # PDFを PostScript に変換
  pdffonts sample.pdf             # 埋め込まれているフォントの確認
  pdftotext sample.pdf            # PDFからテキストを抽出
#+END_SRC
** COMMENT git
*** インストール
1) git 本体をインストール
   #+BEGIN_SRC sh
     brew install git
   #+END_SRC
2) SourceTree のインストール
   インストール方法や使い方については
   http://www.backlog.jp/git-guide/
   が参考になる．
*** 各種設定
1) プッシュのデフォルト方式を =simple= (現在のブランチと同じ名前のブランチがリモートにある場合にのみプッシュ)にする([[http://qiita.com/yaotti/items/a8e9f5de8dcca81d3214][参考]])．
   #+BEGIN_SRC sh
     git config --global push.default.simple
   #+END_SRC
** COMMENT wget
*** 概要
HTTP や FTP 経由でファイルを取得する．Mac OS X 標準の =curl= よりも高機能．
*** インストール
#+begin_src screen
$ brew install wget
#+end_src
** COMMENT rsync (http://rsync.samba.org)
*** 機能概要
フォルダのバックアップや同期を取る．
*** インストール
=homebrew/dupes= をリポジトリに追加していれば，以下でインストール可能：
#+BEGIN_SRC screen
$ brew install rsync
#+END_SRC
** COMMENT git (http://git-scm.com)
*** 機能概要
分散リポジトリバージョン管理システム．
*** インストール
#+BEGIN_SRC screen
$ brew install git
#+END_SRC
** COMMENT magit (http://philjackson.github.io/magit/)
*** 機能概要
Emacs上で動く Git 用ツール
*** インストール
#+BEGIN_SRC screen
$ brew install magit
#+END_SRC
** COMMENT auctex (http://www.gnu.org/software/auctex/)
*** 機能概要
EmacsでのTeXファイル編集を支援する．
*** インストール
#+BEGIN_SRC screen
brew install --with-emacs=/Applications/Emacs.app/Contents/MacOS/Emacs auctex 
#+END_SRC
** COMMENT ghostscript (http://www.ghostscript.com)
*** 機能概要
Postscript インタプリタ．Emacs上でPDFや画像ファイルを表示させる docview に必須．
*** インストール
#+BEGIN_SRC screen
brew install ghostscript
#+END_SRC
* XQuartz のインストール
XQuartz は OS X 上で動作する Xウィンドウシステム．各種パッケージの際に必要となる．
- ターミナルで下記を入力:
  #+BEGIN_SRC sh
  brew cask install xquartz
  #+END_SRC
  必要に応じて管理者パスワードを入力.
** COMMENT
- http://xquartz.macosforge.org/landing/ から最新版の dmg ファイルをダウンロードし，pkg ファイルをダブルクリック
- インストール後にログインし直す必要がある．



