homebrew-packages.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2017-02-01 Wed 09:37 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>ITL/Homebrew でインストールするパッケージ</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Takeshi Nagae" />
<link rel=stylesheet href="style.css" type="text/css">


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://nagae.github.io/itl"> UP </a>
 |
 <a accesskey="H" href="https://nagae.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">ITL/Homebrew でインストールするパッケージ</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline5">1. Homebrew でインストールしておくべき UNIX ツール</a>
<ul>
<li><a href="#orgheadline1">1.1. 以下を実行する</a></li>
<li><a href="#orgheadline4">1.2. xpdf に日本語サポートパッケージを追加する</a></li>
</ul>
</li>
<li><a href="#orgheadline6">2. XQuartz のインストール</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">1</span> Homebrew でインストールしておくべき UNIX ツール</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> 以下を実行する</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-screen"><span style="color: #00cd66;"># </span><span style="color: #00cd66;">&#20197;&#19979;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12399;&#29420;&#31435;&#12375;&#12390;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12391;&#12365;&#12427;(&#20182;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12395;&#20381;&#23384;&#12375;&#12394;&#12356;)</span>
brew install git                <span style="color: #00cd66;"># </span><span style="color: #00cd66;">&#20998;&#25955;&#12522;&#12509;&#12472;&#12488;&#12522;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12471;&#12473;&#12486;&#12512;&#65294;</span>
brew install nkf                <span style="color: #00cd66;"># </span><span style="color: #00cd66;">&#12501;&#12449;&#12452;&#12523;&#12398;&#25991;&#23383;&#12467;&#12540;&#12489;&#12434;&#19968;&#25324;&#12391;&#22793;&#25563;&#12391;&#12365;&#12427;</span>
brew install ispell             <span style="color: #00cd66;"># </span><span style="color: #00cd66;">&#12473;&#12506;&#12523;&#12481;&#12455;&#12483;&#12459;&#12540;</span>
brew install lha                <span style="color: #00cd66;"># </span><span style="color: #00cd66;">.lha&#12420;.lzh &#24418;&#24335;&#12434;&#23637;&#38283;&#12377;&#12427;&#12398;&#12395;&#24517;&#35201;</span>
<span style="color: #00cd66;"># </span><span style="color: #00cd66;">&#20197;&#19979;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12399;&#20182;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12395;&#20381;&#23384;&#12377;&#12427;</span>
brew install rsync              <span style="color: #00cd66;"># </span><span style="color: #00cd66;">&#12501;&#12457;&#12523;&#12480;&#12398;&#12496;&#12483;&#12463;&#12450;&#12483;&#12503;&#12420;&#21516;&#26399;&#12434;&#21462;&#12427;&#65294;</span>
brew install ghostscript        <span style="color: #00cd66;"># </span><span style="color: #00cd66;">Postscript &#12452;&#12531;&#12479;&#12503;&#12522;&#12479;&#65294;Emacs&#19978;&#12391;PDF&#12420;&#30011;&#20687;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12373;&#12379;&#12427; docview &#12395;&#24517;&#38920;&#65294;</span>
brew install wget               <span style="color: #00cd66;"># </span><span style="color: #00cd66;">&#12454;&#12455;&#12502;&#12469;&#12540;&#12496;&#12540;&#12363;&#12425;&#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#65294;curl &#12424;&#12426;&#39640;&#27231;&#33021;</span>
brew install imagemagick --with-tex <span style="color: #00cd66;"># </span><span style="color: #00cd66;">&#30011;&#20687;&#25805;&#20316;&#12539;&#34920;&#31034;&#29992;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;</span>
brew install xpdf                   <span style="color: #00cd66;"># </span><span style="color: #00cd66;">PDF&#29992;&#12518;&#12540;&#12486;&#12451;&#12522;&#12486;&#12451;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.2</span> xpdf に日本語サポートパッケージを追加する</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2"><span class="section-number-4">1.2.1</span> 日本語サポートパッケージの追加</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>参考URL:
<ul class="org-ul">
<li><a href="http://ototorosama.hatenablog.com/entry/2013/02/14/055355">http://ototorosama.hatenablog.com/entry/2013/02/14/055355</a></li>
<li><a href="http://d.hatena.ne.jp/rougeref/20070313">http://d.hatena.ne.jp/rougeref/20070313</a></li>
</ul></li>
<li>ターミナルで下記を入力<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>：</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b0c4de;">pushd</span> ~/Downloads
curl -O http://ftp.jaist.ac.jp/pub/CTAN/support/xpdf/xpdf-japanese.tar.gz <span style="color: #00cd66;"># </span><span style="color: #00cd66;">ftp.jaist.ac.jp &#12398;&#20195;&#12431;&#12426;&#12395; ftp.rikengo.jp, ftp.u-aizu.ac.jp, ftp.kd&#173;di&#173;l&#173;abs.jp &#12398;&#12393;&#12428;&#12363;&#12434;&#20351;&#12387;&#12390;&#12418;&#12424;&#12356;</span>
tar -xzvf xpdf-japanese.tar.gz
<span style="color: #b0c4de;">cd</span> xpdf-japanese
ln -s /usr/local/opt/xpdf/share/ /usr/local/share/xpdf <span style="color: #00cd66;"># </span><span style="color: #00cd66;">xpdf/share &#12408;&#12398;&#12471;&#12531;&#12508;&#12522;&#12483;&#12463;&#12522;&#12531;&#12463;&#12434;&#20316;&#25104;</span>
mkdir /usr/local/share/xpdf/japanese                   <span style="color: #00cd66;"># </span><span style="color: #00cd66;">japanese &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12434;&#20316;&#25104;</span>
cp -r * /usr/local/share/xpdf/japanese                 <span style="color: #00cd66;"># </span><span style="color: #00cd66;">xpdf-japanese &#12398;&#20013;&#36523;&#12434;&#12467;&#12500;&#12540;</span>
cat /usr/local/share/xpdf/japanese/add-to-xpdfrc &gt;&gt; /usr/local/etc/xpdfrc <span style="color: #00cd66;"># </span><span style="color: #00cd66;">xpdfrc &#12395;&#36861;&#35352;</span>
<span style="color: #b0c4de;">popd</span>
</pre>
</div>
<ul class="org-ul">
<li><p>
<code>/usr/local/etc/xpdfrc</code> を編集する:
</p>

<p>
Emacs や テキストエディットなどで <code>/usr/local/etc/xpdfrc</code> を開き, 
<code>textEncoding</code> の行を探してコメントアウトを解除(行頭の <code>#</code> を削除)する.
</p>

<p>
修正前:
</p>
<div class="org-src-container">

<pre class="src src-text"># textEncoding                UTF-8
</pre>
</div>
<p>
修正後:
</p>
<div class="org-src-container">

<pre class="src src-text">textEncoding          UTF-8
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3"><span class="section-number-4">1.2.2</span> 使い方</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
例えば， <code>sample.pdf</code> に対して, ターミナルから以下のような処理が行なえる:
</p>
<div class="org-src-container">

<pre class="src src-sh">pdfinfo sample.pdf              <span style="color: #00cd66;"># </span><span style="color: #00cd66;">PDF&#12398;&#25991;&#26360;&#24773;&#22577;&#12434;&#27161;&#31034;</span>
pdftops sample.pdf              <span style="color: #00cd66;"># </span><span style="color: #00cd66;">PDF&#12434; PostScript &#12395;&#22793;&#25563;</span>
pdffonts sample.pdf             <span style="color: #00cd66;"># </span><span style="color: #00cd66;">&#22475;&#12417;&#36796;&#12414;&#12428;&#12390;&#12356;&#12427;&#12501;&#12457;&#12531;&#12488;&#12398;&#30906;&#35469;</span>
pdftotext sample.pdf            <span style="color: #00cd66;"># </span><span style="color: #00cd66;">PDF&#12363;&#12425;&#12486;&#12461;&#12473;&#12488;&#12434;&#25277;&#20986;</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">2</span> XQuartz のインストール</h2>
<div class="outline-text-2" id="text-2">
<p>
XQuartz は OS X 上で動作する Xウィンドウシステム．各種パッケージの際に必要となる．
</p>
<ul class="org-ul">
<li><p>
ターミナルで下記を入力:
</p>
<div class="org-src-container">

<pre class="src src-sh">brew cask install xquartz
</pre>
</div>
<p>
必要に応じて管理者パスワードを入力.
</p></li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">&#33050;&#27880;: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
この方法だと <code>brew uninstall xpdf</code> とした時に <code>/usr/local/share/xpdf</code> が残ってしまうので， <code>brew prune</code> が必要．
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: Takeshi Nagae</p>
<p class="date">Created: 2017-02-01 Wed 09:37</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
